from string import Template
#### محفزات RAG ####

#### النظام ####

system_prompt = Template("\n".join([
    "أنت مساعد لإنشاء رد على استفسار المستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
    "يجب أن تقوم بإنشاء الرد بناءً على المستندات المقدمة.",
    "تجاهل أي مستندات غير مرتبطة باستفسار المستخدم.",
    "يمكنك أن تعتذر للمستخدم إذا لم تتمكن من إنشاء رد.",
    "يجب أن يكون الرد بنفس لغة استفسار المستخدم.",
    "كن مهذبًا ومحترمًا مع المستخدم.",
    "كن دقيقًا وموجزًا في ردك. تجنب المعلومات غير الضرورية.",
]))

#### المستند ####
document_prompt = Template(
    "\n".join([
        "## رقم المستند: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

#### التذييل ####
footer_prompt = Template("\n".join([
    "بناءً فقط على المستندات أعلاه، الرجاء إنشاء رد للمستخدم.",
    "## الرد:",
]))
0